{"earlier_experience":{"title":"Earlier Experience","dates":"1999 – 2014","description":"Foundations in enterprise systems, consulting, and early web scale, with emphasis on craftsmanship, mentoring, and resilient delivery under real production constraints. Built revenue-critical systems, introduced CI/CD practices, and moved from .NET to early Ruby/Rails adoption through community-driven engineering cultures.","items":[{"company":"Obtiva","role":"Software Craftsman","summary":"Craftsmanship-focused consultancy; community leadership (Geekfest), mentorship, and transition from .NET to early Ruby/Rails delivery"},{"company":"Coderwall / UpCity / Viewpoints","role":null,"summary":"Startup platform work; full-stack delivery and scaling foundations"},{"company":"TicketsNow","role":null,"summary":"Revenue-critical fulfillment system; $2M+/year impact; acquired by Ticketmaster"},{"company":"BrightStar / Motorola / BP","role":null,"summary":"Enterprise .NET integration and operational systems across large organizations"}]},"leadership":{"title":"Technical Leadership","items":["Established enterprise-wide OpenTelemetry standards and transitioned ownership after adoption stabilized across teams","Created an enablement function separating platform risk work from product delivery to sustain long-horizon remediation","Built Communities of Practice to prevent architectural drift and align cross-team decisions","Built and ran global engineering onboarding and training at Groupon during hypergrowth, improving ramp time and retention","Founded Software Craftsmanship McHenry County (2009), handed off leadership after two years, and built a community that still meets with 823 members","Founded WHOIS Tech Community (UGtastic), interviewing industry leaders and shaping software craftsmanship discourse"]},"profile":{"name":"Mike Hall","title":"Staff Software Engineer","contact":{"email":"mike@just3ws.com","phone":"(847) 877-3825","phone_tel":"+18478773825","website":{"url":"https://www.just3ws.com","display":"just3ws.com"},"linkedin":{"url":"https://www.linkedin.com/in/just3ws/","display":"in/just3ws"},"github":{"url":"https://github.com/just3ws","display":"github.com/just3ws"}}},"skills":{"title":"Skills","categories":[{"name":"Languages","items":["Ruby","SQL","JavaScript","C#","Java","Clojure"]},{"name":"Frameworks & Tools","items":["Ruby on Rails","PostgreSQL","Redis","Linux","AWS","OpenTelemetry","CI/CD"]},{"name":"Practices","items":["Architectural Ownership","Platform Modernization","Observability Strategy","Incident Response & Postmortems","Risk Management","Cross-Team Influence","Technical Strategy","Mentoring","AI-augmented development (pairing, review, refactoring)","System Legibility"]}]},"summary":{"title":"Summary","text":"Staff-level engineer who sets direction for critical platforms, makes system behavior legible, and reduces systemic risk so multi-team plans are grounded in reality. Known for aligning engineering, product, and leadership on what’s required to stabilize and evolve systems, enabling durable change tied to business outcomes."},"timeline":{"items":["onemain","sk-holdings","activecampaign","benchprep","reachlocal","klobomedia","coderwall"],"history":["onemain","sk-holdings","activecampaign","tandem","benchprep","reachlocal","klobomedia","coderwall","upcity","viewpoints","groupon","obtiva","bdi","jpmc","brightstar","ticketsnow","bp","motorola","riverpoint","ips","new-labor-strategies","trippe","sentinel","ch-robinson"]},"positions":{"activecampaign":{"company":{"name":"ActiveCampaign","location":"Chicago, IL"},"title":"Senior Software Developer","type":"Contract","start_date":"September 2018","end_date":"December 2018","context":"ActiveCampaign is a large-scale marketing automation and CRM platform serving a global customer base. The system included a mature PHP backend with a highly coupled core responsible for contact management, business rules, and data access, alongside a modernizing frontend stack.","scope":{"scale":"Large, high-traffic CRM platform with complex legacy core","ownership":"Testability, performance, and change safety within core systems","influence":"Engineering teams responsible for backend and frontend reliability"},"description":"Engaged as a short-term senior contributor to address deep structural complexity in the core backend systems. Focused on improving testability, performance, and change safety within a tightly coupled legacy PHP codebase, while making targeted frontend enhancements to stabilize and extend the existing test suite.","achievements":{"highlights":["Diagnosed structural constraints in the core backend subsystem and established a path for safe iteration on contact management and business rules.","Introduced testable query patterns and caching strategies to replace ad-hoc global data access, improving performance and enabling more reliable automated testing.","Reduced risk in a highly coupled legacy codebase by isolating critical behaviors behind clearer boundaries, enabling incremental change without large-scale rewrites.","Extended and hardened the existing frontend test suite in Ember, improving reliability and confidence in UI-driven workflows.","Improved developer feedback loops by making previously opaque behavior observable through tests rather than runtime debugging."]},"skills":["Legacy System Modernization","Backend System Architecture","Testability and Change Safety","Performance Optimization","PHP","MySQL","Ember.js","JavaScript","Automated Testing"]},"bdi":{"company":{"name":"Business Decisions, Inc.","location":"Remote"},"title":"Principal Developer","start_date":"October 2008","end_date":"August 2009","description":"Owned primary development and support for all BDI systems. Partnered with the primary stakeholder on technical strategy and managed teams across multiple consulting firms. Simplified contractor onboarding by providing standardized VM images, reducing setup time. Introduced Subversion for version control.","skills":["ASP.NET","Agile","C#","CSS","CruiseControl.NET (CCNET)","HTML","Internet Information Services (IIS)","JSON","JavaScript","Microsoft SQL Server","NLog","NUnit","Ruby","SharePoint","Subversion","Transact-SQL (T-SQL)","UML","VMWare","Visual Studio .NET","Watir","Windows Server","XML","jQuery"]},"benchprep":{"company":{"name":"BenchPrep","location":"Chicago, IL"},"title":"Senior Software Developer","type":"Full-time","start_date":"March 2017","end_date":"February 2018","context":"BenchPrep provides learning and assessment platforms used in high-stakes certification and evaluation workflows. The platform supports enterprise clients where calculation accuracy, response integrity, and secure data exchange are critical to business trust and downstream outcomes.","scope":{"scale":"Enterprise clients, high-stakes assessment workflows","ownership":"Assessment correctness, data integrity, and secure platform boundaries"},"description":"Took ownership of improving correctness, performance, and security for high-stakes assessment workflows. Focused on eliminating calculation errors, hardening response integrity, and defining safe integration boundaries for embedded client applications while improving database performance under load.","achievements":{"highlights":["Diagnosed and eliminated assessment calculation errors by analyzing and optimizing critical PostgreSQL queries using EXPLAIN ANALYZE and query planning tools, improving accuracy and response times.","Implemented JWT-based response verification to prevent tampering and enforce once-only processing of assessment submissions, strengthening trust in platform outcomes.","Designed and built a secure cross-origin communication API to support embedded client applications, establishing explicit trust boundaries between host and embedded contexts.","Reduced operational risk by identifying and resolving performance bottlenecks affecting high-concurrency assessment workflows.","Improved delivery reliability by introducing lightweight team practices that clarified acceptance criteria and reduced rework in high-impact assessment workflow changes."]},"skills":["Backend System Architecture","Data Integrity and Correctness","Secure API Design","Trust Boundary Definition","Database Performance Optimization","PostgreSQL","JWT Authentication","Ruby","Ruby on Rails","JavaScript","Observability and Logging"]},"bp":{"company":{"name":"BP","location":"Naperville, IL"},"title":"Senior Software Developer","type":"Contract","start_date":"June 2005","end_date":"November 2005","description":"Delivered new features for the Process Fitness invoicing system, improving operational billing workflows.","skills":["ASP.NET","CSS","HTML","Internet Information Services (IIS)","JavaScript","Microsoft SQL Server","Transact-SQL (T-SQL)","Visual Basic .NET (VB.NET)","Visual SourceSafe","Visual Studio .NET","Windows Server"]},"brightstar":{"company":{"name":"Brightstar Corporation","location":"Libertyville, IL"},"title":"Senior .NET Developer","start_date":"March 2007","end_date":"April 2008","description":"Improved end-to-end purchase order visibility across the sales and inventory chain by integrating BizTalk workflows, Solomon financial systems, third-party packages, and custom internal applications into a unified operational model, surfaced via an executive dashboard for supply-chain oversight.","skills":["ASP.NET","C#","CSS","CruiseControl.NET (CCNET)","HTML","Internet Information Services (IIS)","JavaScript","Microsoft BizTalk Server","Microsoft SQL Server","NLog","NUnit","Oracle Fusion","SOAP","Solomon Accounting Software","SubSonic ORM","Subversion","Trac","Transact-SQL (T-SQL)","Visual Basic","Visual Studio .NET","XML"]},"ch-robinson":{"company":{"name":"C.H. Robinson","location":"Oakbrook, IL"},"title":"System Administrator","start_date":"December 1999","end_date":"July 2000","description":"Local administrator responsible for site hardware, system upgrades, and user support. Proactively pursued training and proposed an automated shipment booking solution to reduce manual workflow friction.","skills":["Windows NT","Windows 98"]},"coderwall":{"company":{"name":"Coderwall","location":"Remote"},"title":"Core Team Lead","type":"Contract","start_date":"January 2014","end_date":"December 2014","description":"Re-launched Coderwall as an open-source project and led the community development efforts.","achievements":{"highlights":["Relaunched Coderwall as an open-source project and guided a diverse contributor community.","Replaced Resque with Sidekiq to reduce background job cost on Heroku.","Replaced MongoDB with Postgres to simplify queries, reduce costs, and improve maintainability.","Improved Elasticsearch queries and upgraded the service to stabilize search performance and relevance."]},"skills":["AWS S3","Airbrake","Backbone.js","Bash","CSS","ElasticSearch","Git","GitHub","GitHub API","XHTML","Heroku","JRuby","JavaScript","MongoDB","Packer","PostgreSQL","Puma","RSpec","Redis","Ruby","Ruby on Rails","Sass","Sidekiq","Stripe","Vagrant","Vim","Z shell (Zsh)","jQuery"]},"groupon":{"company":{"name":"Groupon","location":"Chicago, IL"},"title":"Engineering Learning & Development Business Partner","start_date":"July 2011","end_date":"May 2013","description":"Delivered fraud analysis, internal tooling, and a centralized taxonomy service across multiple stacks. Transitioned to leading efforts to rebuild and improve onboarding and engineering retention programs.","achievements":{"highlights":["Built merchant analysis tools in Ruby and CouchDB to generate reports used by sales to identify high-value markets and deals.","Rebuilt onboarding and facilitated training across multiple sites; partnered with TalentDev to improve ramp consistency and strengthen manager training.","Designed fraud pattern queries in Vertica and spiked Hadoop/Clojure detection tools to scale analysis.","Implemented a centralized taxonomy service in Java/MySQL and built the servers to host it, enabling consistent categorization across teams."]},"skills":["AWS EC2","AWS S3","Airbrake","Apache","Bash","Bootstrap","CSS","Capistrano","Clojure","CouchDB","Cucumber","Git","GitHub","Hadoop","Hubot","Java","JavaLite","JavaScript","Jetty","Mongrel","MySQL","NGINX","Node.js","RSpec","Raphael.js","Redis","Resque","Ruby","Ruby on Rails","Sass","Thin","Unicorn","Vagrant","Vertica","Vim","XHTML","Z shell (Zsh)","jQuery"]},"ips":{"company":{"name":"Integrated Performance Solutions, Inc.","location":"East Dundee, IL"},"title":"Programmer Analyst","start_date":"November 2003","end_date":"July 2004","description":"Created simple-to-use but feature-rich custom report rules modeling interface using JavaScript and CSS for the UI with ASP on the server.\nBuilt a dynamic SQL rules wizard in ASP using early JSON techniques to enable flexible reporting. Developed reporting widgets using ASP.NET Web Forms Components, building early .NET experience after a largely classic ASP environment.","skills":["ASP.NET","Active Server Pages (ASP)","CSS","HTML","Internet Information Services (IIS)","JSON","JavaScript","Microsoft SQL Server","Transact-SQL (T-SQL)","Visual InterDev","Visual SourceSafe","Visual Studio .NET","Windows Server"]},"jpmc":{"company":{"name":"JPMorgan Chase & Co.","location":"Chicago, IL"},"title":"Assistant Vice President, Application Developer","start_date":"April 2008","end_date":"October 2008","description":"Contributed to the Commercial Card platform by identifying and resolving cross-system integration failures between distributed .NET services and mainframe systems, restoring stability to regulated financial workflows.","skills":["ASP.NET","C#","CSS","HTML","IMB Rational","Internet Information Services (IIS)","JSON","JavaScript","Microsoft SQL Server","SOAP","Transact-SQL (T-SQL)","Visual Basic .NET (VB.NET)","Visual Studio .NET","Windows Server","XML"]},"klobomedia":{"company":{"name":"KloboMedia","location":"Remote"},"title":"CTO","start_date":"March 2014","end_date":"September 2016","context":"KloboMedia was an early-stage startup building social media analytics tools for professionals and agencies. As CTO and technical co-founder, owned all technology decisions, infrastructure, and product development from inception.","scope":{"scale":"Early-stage startup, multi-platform social API integration","ownership":"Full technical ownership (architecture, infrastructure, product)","influence":"Technical co-founder, cross-functional with design consultants"},"description":"Technical co-founder/CTO (concurrent) responsible for all technology decisions, architecture, and product delivery. Built a customer-serving social media analytics platform from inception through deployment under evolving third-party API constraints.","achievements":{"highlights":["Architected and built complete social media analytics platform integrating Twitter, Facebook, and Instagram APIs to aggregate cross-platform insights for agency clients.","Designed high-throughput data pipeline using Sidekiq Enterprise to process social media patterns and generate actionable recommendations.","Implemented PostgreSQL JSONB storage strategy enabling flexible querying of heterogeneous social media data without schema migrations.","Built and secured production infrastructure across DigitalOcean, Heroku, and Amazon RDS with automated deployment pipelines.","Led product development and coordinated with design consultants to deliver customer-facing analytics interface and administrative reporting tools aligned to founder and investor expectations.","Managed external teams to accelerate UI delivery while maintaining architectural consistency."]},"skills":["Ruby","Ruby on Rails","PostgreSQL","Redis","Sidekiq","Amazon RDS","Heroku","DigitalOcean","Twitter API","Facebook Graph API","Instagram API","New Relic","Rollbar"]},"motorola":{"company":{"name":"Motorola","location":"Libertyville, IL"},"title":"Senior Software Developer","type":"Contract","start_date":"August 2004","end_date":"May 2005","description":"Delivered new features for a sales portfolio application used for retail sales support while operating inside a large, multi-director enterprise environment. First formal exposure to Scrum; observed the impact of process discipline and organizational friction on delivery.","skills":["ASP.NET","C#","CSS","HTML","Internet Information Services (IIS)","JavaScript","Microsoft SQL Server","NAnt","NUnit","SOAP","Scrum","Transact-SQL (T-SQL)","Visual Basic .NET (VB.NET)","Visual SourceSafe","Visual Studio .NET","Windows Server","XML"]},"new-labor-strategies":{"company":{"name":"New Labor Strategies, Inc.","location":"Park Ridge, IL"},"title":"Programmer Analyst","start_date":"June 2002","end_date":"November 2003","description":"Developed modules for a kiosk-based HR system designed for factory floor installations, including coupon management, employee information, a touch-screen keyboard generator, and internal job posting/bidding. Pushed for browser-side JavaScript and modern practices within a VBScript-heavy codebase.","skills":["Active Server Pages (ASP)","ActiveX","CSS","HTML","Internet Information Services (IIS)","JavaScript","Microsoft SQL Server","Transact-SQL (T-SQL)","VBScript","Windows 2000 Server"]},"obtiva":{"company":{"name":"Obtiva","location":"Chicago, IL"},"title":"Software Engineer","start_date":"August 2009","end_date":"July 2011","description":"Consultant dispatched to clients to work independently and in team environments. Worked on projects building B2B services for Sears, internal report generation systems for Leapfrog Online, and with Groupon prior to the acquisition. Brought in for .NET work based on Alt.NET community reputation and transitioned into Ruby/Rails delivery in a craftsmanship-focused consultancy.","achievements":{"highlights":["Engaged at Leapfrog Online to implement reporting services to expose customizable reports against their data warehouse.","Engaged at Sears Commercial to implement a new commercial sales and catalog service for B2B customers.","Engaged at Groupon to work on deals services, primary site support, and fraud analysis teams."]},"skills":["Active Directory","Bash","C#","CSS","Capistrano","Cucumber","Git","GitHub","Internet Information Services (IIS)","JRuby","JavaScript","MbUnit","Mercurial","Microsoft SQL Server","Microsoft SQL Server Reporting Services (SSRS)","Mongrel","MySQL","NGINX","NUnit","QUnit","RSpec","Redis","Resque","Ruby","Ruby on Rails","Sass","Thin","Unicorn","Vagrant","Vim","Visual Studio .NET","Windows Server","XHTML","jQuery"]},"onemain":{"company":{"name":"OneMain Financial","location":"Remote"},"title":"Associate Director, Staff Engineer","type":"Full-time","start_date":"January 2021","end_date":"February 2026","context":"OneMain Financial is one of the largest consumer installment lenders in the United States, serving millions of customers through ~1,400 branches and digital channels. The company specializes in personal loans for non-prime borrowers, operating in a heavily regulated financial services environment with strict compliance requirements. The Acquisitions platform owns the customer-facing loan application flow—a revenue-critical system processing high volumes of applications daily under strict availability, auditability, and data-integrity constraints.","scope":{"scale":"Millions of customers, ~1,400 branches, revenue-critical loan acquisition","ownership":"End-to-end lane-level architecture, production health, and systemic risk","influence":"Cross-functional across engineering, product, cybersecurity, and executive leadership","initiatives":"Enterprise observability adoption, platform remediation, incident leadership, engineering communities"},"description":"Owned lane-level architecture for the Acquisitions platform, spanning customer application flows, partner integrations, and a large legacy application estate in a regulated financial environment. Operated as a senior individual contributor accountable for architectural integrity, production stability, and cross-team execution, with authority established through incident leadership, deep system knowledge, and cross-team trust. Focused on making system behavior observable and understandable across teams to enable data-driven decisions, reduce systemic risk, and support reliable change in long-lived systems.","achievements":{"summary":"Delivered durable reductions in systemic risk and incident recurrence by restoring architectural legibility in a complex, legacy-heavy environment. Served as the final escalation point for production incidents and embedded shared understanding, observability, and operational discipline as enduring organizational capabilities.","highlights":["Acted as the final escalation point for high-severity production incidents, taking ownership of live diagnosis during large cross-functional calls, coordinating investigation across teams, establishing a shared understanding of system behavior, and driving concrete action plans with clear follow-up ownership.","Transformed incident response into institutional learning by ensuring every major failure resulted in improved monitoring, clarified ownership, updated documentation, refined operational processes, and corrected cross-team touchpoints across systems with decades of accumulated history.","Reconstructed end-to-end customer acquisition flows by mapping execution context from the customer’s browser through application layers, enterprise service middleware, and downstream business systems, creating an authoritative operational model to ground incident response, risk review, and change planning in observed reality.","Designed and delivered a re-architecture of session state handling across complex, multi-step user workflows, eliminating a persistent integrity failure mode that impaired customer tracking, diagnosis, and incident recovery under real production conditions.","Founded and led the OpenTelemetry Working Group, establishing shared observability standards and training engineering and cybersecurity teams to reason about system behavior using common telemetry; transitioned ownership once practices were institutionalized and adoption became self-sustaining.","Led platform modernization and lifecycle remediation under continuous production load, maintaining regulatory compliance while reducing operational risk and restoring the ability to safely evolve legacy systems.","Re-architected fragmented engineering ownership into a single accountable operating model, clarifying architectural responsibility and escalation paths as a necessary consequence of observed production realities.","Founded an enablement function to isolate cross-cutting platform, risk, and remediation work from feature delivery, enabling sustained progress on long-horizon stability initiatives without disrupting customer-facing teams.","Surfaced and led remediation of systemic integrity risks in high-volume financial workflows, improving transaction reliability and reducing enterprise risk."]},"skills":["Platform Architecture","System Resilience","Incident Leadership","Observability","Legacy System Modernization","Distributed Systems","Ruby on Rails","PostgreSQL","OpenTelemetry","AWS"]},"reachlocal":{"company":{"name":"ReachLocal","location":"Remote"},"title":"Senior Software Developer","type":"Full-time","start_date":"March 2015","end_date":"November 2016","context":"ReachLocal provided a large-scale digital marketing platform supporting thousands of small and mid-sized businesses. The system combined lead management, campaign execution, subscription billing, and reporting, and included a long-lived legacy codebase with significant data volume and historical complexity.","scope":{"scale":"Thousands of customers, high-volume transactional and reporting data","ownership":"API design, legacy system modernization strategy, integration boundaries","influence":"Cross-team across engineering, product, and customer-facing functions"},"description":"Contributed to platform modernization efforts during a period of organizational transition and acquisition. Designed and implemented new API layers to safely expose internal capabilities, while working with the Customer Funnel team to evaluate and de-risk a planned rewrite of a large legacy system. Identified fundamental data and system knowledge gaps that informed a shift toward incremental modernization rather than wholesale replacement.","achievements":{"highlights":["Designed and built an API Gateway to expose selected internal services through well-defined, secure interfaces, enabling controlled integration with internal and external consumers.","Evaluated the feasibility of a full rewrite of a legacy customer-facing system and demonstrated that unclear data lineage and billions of existing records made a big-bang migration impractical and high risk.","Proposed and validated an incremental modernization strategy in which a new API layer operated alongside the legacy system, allowing new features to be developed independently while legacy functionality was migrated selectively.","Designed a two-tier frontend architecture that separated user experience iteration from backend system constraints, reducing regression risk while enabling faster experimentation without destabilizing core systems.","Modernized critical integration points by wrapping legacy functionality in Rails APIs, extending the useful life of the existing platform while enabling gradual transition to newer components.","Reduced operational and maintenance risk by introducing code quality and security tooling, improving visibility into system health and failure modes."]},"skills":["Platform Architecture","API Gateway Design","Legacy System Modernization","Incremental Migration Strategies","Secure API Design","Data Migration Strategy","Ruby","Ruby on Rails","PostgreSQL","React","Redis","CI/CD and Code Quality Tooling"]},"riverpoint":{"company":{"name":"Riverpoint Group","location":"Des Plaines, IL"},"title":"Software Developer","type":"Contract","start_date":"July 2004","end_date":"August 2004","description":"Built ASP.NET Web Forms Components widgets for a personal health monitoring website, focusing on reliable UI component delivery.","skills":["ASP.NET","CSS","HTML","Internet Information Services (IIS)","JavaScript","Microsoft SQL Server","Transact-SQL (T-SQL)","Visual Basic .NET (VB.NET)","Visual SourceSafe","Visual Studio .NET","Windows Server"]},"sentinel":{"company":{"name":"Sentinel Technologies, Inc.","location":"Downers Grove, IL"},"title":"Application Analyst","start_date":"July 2000","end_date":"October 2001","description":"Contributed to software development for clients including International Reprographics Association, Kolcraft, Cook County, Tripplite, \"Meckler, Bulgar, Tilson\", Harley-Davidson Motorcycles, \"Mack and Parker\", and the Chase Group. Delivered an early OCR pipeline (awk/sed + OCR tooling) to digitize large volumes of receipts into a database, navigating semi-structured text and scanner calibration constraints. The work functioned at small scale and informed a decision to pursue a different approach for full-scale digitization.","skills":["Active Server Pages (ASP)","ActiveX","CSS","HTML","Internet Information Services (IIS)","Java","Java Server Pages (JSP)","Java WebSphere","JavaScript","Microsoft Access","Microsoft SQL Server","Transact-SQL (T-SQL)","VBScript","Visual Basic","Visual Basic for Applications (VBA)","Visual InterDev","Visual J++","Visual SourceSafe","Windows NT","Windows Server"]},"sk-holdings":{"company":{"name":"SK Holdings, Inc.","location":"Chicago, IL"},"title":"Senior Backend Developer","type":"Full-time","start_date":"January 2019","end_date":"December 2020","context":"SK Holdings operated multiple digital media and subscription-oriented businesses supported by a shared Ruby on Rails backend platform. The platform handled content delivery, account and subscription management, billing, and high-volume campaign operations. Systems processed millions of users and contacts and evolved under ongoing business change, partnerships, and asset transitions.","scope":{"scale":"Millions of users and contacts across multi-property platforms","ownership":"Core Rails platform modernization, data pipelines, and system performance","influence":"Cross-functional across engineering, operations, product, and external vendors"},"description":"Took broad ownership of stabilizing and modernizing a shared Ruby on Rails platform supporting multiple business lines. Operated as a high-leverage individual contributor addressing architectural complexity, operational blind spots, and performance constraints while making system behavior legible, expanding observability, improving delivery reliability, and increasing insight into system and business behavior. Portions of this work supported preparation of platform-backed assets for external transition, alongside ongoing operational demands.","achievements":{"highlights":["Modernized and upgraded large portions of the Ruby and Rails stack across multiple applications, reducing technical debt, addressing security vulnerabilities, and improving long-term maintainability.","Expanded operational visibility by introducing centralized logging and monitoring, working with hosting providers to interpret metrics and establish actionable insight into system behavior and capacity.","Designed and built data pipelines synchronizing millions of records between internal systems and third-party services, enabling reliable high-volume operations and new business initiatives.","Led data-layer remediation efforts by replacing expensive dynamic queries with Materialized Views, materially reducing load on high-traffic reporting and analytics workloads.","Migrated session and cache workloads from MySQL to Redis, isolating transactional databases from non-critical load and improving response times under peak traffic.","Optimized CI pipelines by reordering and parallelizing test execution, materially reducing feedback cycle time and improving delivery throughput."]},"skills":["Platform Modernization","Backend System Architecture","Ruby on Rails","System Observability and Monitoring","CI/CD Optimization","Data Pipelines (ETL)","Data Analytics","Database Performance Optimization","Full-Text Search (PostgreSQL)","Cache Layer Design (Redis)","PostgreSQL","MySQL","Prometheus","Logentries","SendGrid"]},"tandem":{"company":{"name":"Tandem","location":"Chicago, IL"},"title":"Principal Consultant","type":"Contract","start_date":"August 2018","end_date":"August 2018","description":"Short-term advisory engagement for a federal client to assess a high-risk rewrite program and reset scope and delivery assumptions."},"ticketsnow":{"company":{"name":"TicketsNow","location":"Crystal Lake, IL"},"title":"Senior .NET Developer","start_date":"November 2005","end_date":"March 2007","description":"Designed and led the delivery of a real-time inventory locking and order fulfillment service that eliminated duplicate sales of high-demand inventory under concurrent load, guaranteed purchase integrity during checkout, and generated $2M+ in incremental revenue within its first year. Established delivery practices for the Real-Time team by leading its first Scrum project and institutionalizing iterative execution and cross-functional coordination to support revenue-critical systems.","skills":["ASP.NET","C#","CSS","CodeSmith API","ColdFusion","CruiseControl.NET (CCNET)","JSON","JavaScript","Microsoft BizTalk Server","Microsoft SQL Server","NLog","NUnit","Ruby","SOAP","STUN","Scrum","SourceGear Vault","Subversion","Transact-SQL (T-SQL)","UML","Visual Basic .NET (VB.NET)","Visual Studio .NET","Visual Studio Team Services","Watir","Windows Server","XHTML","XML","jQuery"]},"trippe":{"company":{"name":"Trippe Manufacturing, Inc.","location":"Chicago, IL"},"title":"Software Developer","type":"Contract","start_date":"October 2001","end_date":"December 2001","description":"Created custom sales lead tracking application and sales spreadsheet transformation engine for analyzing data structure of an Excel spreadsheet and determining the best strategy for importing its data in the tracking application. Continued delivery directly with the client after the consulting firm exited, keeping business-critical work moving.","skills":["Microsoft Access","Visual Basic","Visual Basic for Applications (VBA)","Visual SourceSafe"]},"upcity":{"company":{"name":"Upcity","location":"Remote"},"title":"Senior Software Developer","start_date":"October 2013","end_date":"February 2014","description":"Collaborated with a distributed team on an SOA architecture web application that helps small to mid-sized businesses improve their search engine and local presence.","achievements":{"highlights":["Integrated the Chargify payment system as a backend for payments and a lightweight CMS for plan details using Ruby on Rails, enabling paid plans and self-serve updates.","Implemented a multi-VM Vagrant environment to replicate the multi-system production stack, reducing onboarding and environment drift."]},"skills":["Bash","CSS","Capistrano","Git","GitHub","JavaScript","Linux","NGINX","PostgreSQL","Puma","REST","RSpec","Redis","Riak","Ruby","Ruby on Rails","Sass","Sidekiq","Trello","Ubuntu","Vagrant","Vim","XHTML","Z shell (Zsh)","jQuery"]},"viewpoints":{"company":{"name":"Viewpoints","location":"Chicago, IL"},"title":"Senior Software Developer","start_date":"May 2013","end_date":"October 2013","description":"Led team supporting development of core business systems.","achievements":{"highlights":["Implemented tracking and marketing tool to enable a new revenue stream for the company.","Simplified the shared development environment and reduced risky practices; built testing and development environments to enable CI.","Streamlined and stabilized the AWS deployment process and built out new server images for easier scaling during high demand periods."]},"skills":["AWS EC2","AWS RDS","AWS S3","Airbrake","Bash","CSS","Capistrano","Git","GitHub","JavaScript","Linux","Logentries","NGINX","PostgreSQL","REST","RSpec","Redis","Resque","Ruby","Ruby on Rails","Sass","Sidekiq","Trello","Ubuntu","Unicorn","Vagrant","Vim","XHTML","Z shell (Zsh)"]}}}
